Config/Catalogs/ДенежныеДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ДенежныеДокументы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВидыДенежныхДокументов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/AccumulationRegisters/ДенежныеДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеДокументы</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КФО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДенежногоДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДенежныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДенежныйДокумент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДенежныеДокументы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Config/AccountingRegisters/ЖурналПроводокЕПСБУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccountingRegister>
		<Properties>
			<Name>ЖурналПроводокЕПСБУ</Name>
			<ChartOfAccounts>ChartOfAccounts.ЕПСБУ</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КПС</Name>
					<Comment>Классификационный признак счета</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоКПС</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КЭК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоКЭК</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИФО</Name>
					<Comment>Источник финансового обеспечения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЖурналОпераций</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Журналы</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КФО</Name>
					<Comment>Код финансового обеспечения</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНеУчитываетсяНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетНеУчитываемых</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЕНВД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетЕНВД</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетНДС</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаДвиженияДт</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаДвиженияКт</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМежотчетногоПериода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМежотчетногоПериода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Config/Catalogs/ДенежныеДокументы/Forms/ФормаПодбораДенежныхДокументов/Ext/Form/Module.bsl
&НаКлиенте
Перем ПеренестиВДокумент;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресДанныхВХранилище = Параметры.АдресДанныхВХранилище;
	
	ЭтаФорма.ЗакрыватьПриВыборе = Ложь;
	
	ЭтаФорма.Заголовок = Параметры.Заголовок;
	
	Элементы.ДенежныеДокументыКоличество.Видимость = Параметры.ПоказыватьОстатки И Параметры.ЕстьКоличество;
	Элементы.ДенежныеДокументыСумма.Видимость = Параметры.ПоказыватьОстатки И Параметры.ЕстьСумма;
	Элементы.ПодобранныеДанныеКоличество.Видимость = Параметры.ЕстьКоличество; 
	Элементы.ПодобранныеДанныеСумма.Видимость = Параметры.ЕстьСумма;
	
	ЕстьСумма = Параметры.ЕстьСумма;
	
	УправлениеСписком();	
	
    ЗагрузитьПереданнуюТабличнуюЧасть(АдресДанныхВХранилище);
	СформироватьИнформационнуюНадпись(ЭтаФорма); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.ВладелецФормы.Объект.Ссылка) Тогда
		ПозицияВ = Найти(ЭтаФорма.Заголовок," в ");
		ЭтаФорма.Заголовок = Лев(ЭтаФорма.Заголовок,ПозицияВ+2) +""""+ ТипЗнч(ЭтаФорма.ВладелецФормы.Объект.Ссылка)+" от "+ЭтаФорма.ВладелецФормы.Объект.Дата+""" "+Сред(ЭтаФорма.Заголовок,ПозицияВ+3);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)

	Если ЗавершениеРаботы И Модифицированность Тогда
		ТекстПредупреждения = ОбщегоНазначенияБГУКлиент.СтандартныйТекстПредупрежденияПриЗавершенииРаботы();
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если ПеренестиВДокумент <> Истина И Модифицированность Тогда
		
		Отказ = Истина;
		
		ТекстВопроса = НСтр("ru = 'Подобранные данные не перенесены в документ.
			|
			|Перенести?'");
			
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);	

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(ОтветНаВопрос, ДопПараметры) Экспорт
	
	Если ОтветНаВопрос = КодВозвратаДиалога.Да Тогда
		ПеренестиВДокумент = Истина;
		Закрыть();
	ИначеЕсли ОтветНаВопрос = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;

	Если ПеренестиВДокумент = Истина Тогда
		АдресДанныхВХранилище = ПоместитьДанныеВХранилище();
		Структура = Новый Структура("АдресДанныхВХранилище", АдресДанныхВХранилище);
		ПеренестиВДокумент = Истина;
		ОповеститьОВыборе(Структура);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборВидДенежногоДокументаПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ДенежныеДокументы.Отбор, "Владелец", ОтборВидДенежногоДокумента, , , ЗначениеЗаполнено(ОтборВидДенежногоДокумента));
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаПриИзменении(Элемент)
	ПрименитьПоиск();
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	
	КоличествоНайденных = 0;
	Для каждого ЭлементСписка Из ИсторияПоиска Цикл
		Если ЛЕВ(ВРег(ЭлементСписка.Значение),СтрДлина(СокрЛП(Текст))) = ВРег(СокрЛП(Текст)) Тогда
			ДанныеВыбора.Добавить(ЭлементСписка.Значение);
			КоличествоНайденных = КоличествоНайденных + 1;
			Если КоличествоНайденных > 7 Тогда
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаОчистка(Элемент, СтандартнаяОбработка)
	ОчиститьПоиск();
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	Элемент.СписокВыбора.ЗагрузитьЗначения(ИсторияПоиска.ВыгрузитьЗначения());	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДенежныеДокументы

&НаКлиенте
Процедура ПодчСпрВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекДанные = Элементы.ДенежныеДокументы.ТекущиеДанные;
	
	ТекВидДД = Неопределено;
	Если ТекДанные.Свойство("Владелец") Тогда
		ТекВидДД = ТекДанные.Владелец;
	КонецЕсли;
	ТекДД = Неопределено;
	Если ТекДанные.Свойство("Ссылка") Тогда
		ТекДД = ТекДанные.Ссылка;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекВидДД) И ЗначениеЗаполнено(ТекДД) Тогда
		ТекКол = 1;
		Если ЗапрашиватьКоличество Тогда
			ПоказатьВводЧисла(Новый ОписаниеОповещения("ПодчСпрВыборЗавершение", ЭтотОбъект, Новый Структура("ТекВидДД, ТекДанные, ТекДД, ТекКол", ТекВидДД, ТекДанные, ТекДД, ТекКол)), ТекКол,НСтр("ru='Введите количество'"),15,0);
            Возврат;
		КонецЕсли;
		
		ПодчСпрВыборФрагмент(ТекВидДД, ТекДанные, ТекДД, ТекКол);

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодчСпрВыборЗавершение(Число, ДополнительныеПараметры) Экспорт
	
	ТекВидДД = ДополнительныеПараметры.ТекВидДД;
	ТекДанные = ДополнительныеПараметры.ТекДанные;
	ТекДД = ДополнительныеПараметры.ТекДД;
	ТекКол = ?(Число = Неопределено, ДополнительныеПараметры.ТекКол, Число);
	
	
	Если НЕ (Число <> Неопределено) Тогда
		Возврат;
	КонецЕсли;
	
	ПодчСпрВыборФрагмент(ТекВидДД, ТекДанные, ТекДД, ТекКол);

КонецПроцедуры

&НаКлиенте
Процедура ПодчСпрВыборФрагмент(Знач ТекВидДД, Знач ТекДанные, Знач ТекДД, Знач ТекКол)
	
	ОбработатьВыборСправочников(ТекВидДД,ТекДД,ТекДанные.НомСтоимость,ТекДанные.Количество,ТекДанные.Сумма,ТекКол);

КонецПроцедуры

&НаКлиенте
Процедура ПодчСпрВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекДанные = Элементы.ДенежныеДокументы.ТекущиеДанные;
	
	ТекВидДД = Неопределено;
	Если ТекДанные.Свойство("Владелец") Тогда
		ТекВидДД = ТекДанные.Владелец;
	КонецЕсли;
	ТекДД = Неопределено;
	Если ТекДанные.Свойство("Ссылка") Тогда
		ТекДД = ТекДанные.Ссылка;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекВидДД) И ЗначениеЗаполнено(ТекДД) Тогда
		
		ТекКол = 1;
		
		Если ЗапрашиватьКоличество Тогда
			ПоказатьВводЧисла(Новый ОписаниеОповещения("ПодчСпрВыборЗначенияЗавершение", ЭтотОбъект, Новый Структура("ТекВидДД, ТекДанные, ТекДД, ТекКол", ТекВидДД, ТекДанные, ТекДД, ТекКол)), ТекКол,НСтр("ru='Введите количество'"),15,0);
            Возврат;
		КонецЕсли;
		
		ПодчСпрВыборЗначенияФрагмент(ТекВидДД, ТекДанные, ТекДД, ТекКол);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПодчСпрВыборЗначенияЗавершение(Число, ДополнительныеПараметры) Экспорт
	
	ТекВидДД = ДополнительныеПараметры.ТекВидДД;
	ТекДанные = ДополнительныеПараметры.ТекДанные;
	ТекДД = ДополнительныеПараметры.ТекДД;
	ТекКол = ?(Число = Неопределено, ДополнительныеПараметры.ТекКол, Число);
	
	
	Если НЕ (Число <> Неопределено) Тогда
		Возврат;
	КонецЕсли;
	
	ПодчСпрВыборЗначенияФрагмент(ТекВидДД, ТекДанные, ТекДД, ТекКол);

КонецПроцедуры

&НаКлиенте
Процедура ПодчСпрВыборЗначенияФрагмент(Знач ТекВидДД, Знач ТекДанные, Знач ТекДД, Знач ТекКол)
	
	ОбработатьВыборСправочников(ТекВидДД,ТекДД,ТекДанные.НомСтоимость,ТекДанные.Количество,ТекДанные.Сумма,ТекКол);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПодобранныеДанные

&НаКлиенте
Процедура ПодобранныеДанныеПриИзменении(Элемент)
	ЭтаФорма.Модифицированность = Истина;
	СформироватьИнформационнуюНадпись(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПодобранныеДанныеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПодобранныеДанныеКоличествоПриИзменении(Элемент)
	ТекДанные = Элементы.ПодобранныеДанные.ТекущиеДанные;
	РассчитатьСуммуСтроки(ТекДанные.ПолучитьИдентификатор());
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)

	ПеренестиВДокумент = Истина;
	Закрыть(КодВозвратаДиалога.OK);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПоместитьДанныеВХранилище()

	ТаблицаДанных = ПодобранныеДанные.Выгрузить();
	
	АдресДанныхВХранилище = ПоместитьВоВременноеХранилище(ТаблицаДанных, УникальныйИдентификатор);

	Возврат АдресДанныхВХранилище;

КонецФункции

&НаСервере
Процедура ЗагрузитьПереданнуюТабличнуюЧасть(АдресДанныхВХранилище)

	Если ЭтоАдресВременногоХранилища(АдресДанныхВХранилище) Тогда
		ТаблицаДанных = ПолучитьИзВременногоХранилища(АдресДанныхВХранилище);
		СсуммируемыеКолонки = "Количество";
		Если ТаблицаДанных.Колонки.Найти("Сумма")<>Неопределено Тогда
			СсуммируемыеКолонки = СсуммируемыеКолонки +",Сумма";
		КонецЕсли;
		ТаблицаДанных.Свернуть("ВидДенежногоДокумента,ДенежныйДокумент",СсуммируемыеКолонки);
		ПодобранныеДанные.Загрузить(ТаблицаДанных);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПрименитьПоиск()

	Использование = ЗначениеЗаполнено(СтрокаПоиска);

	ГруппаОтбора = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
		ДенежныеДокументы.Отбор.Элементы, "ПоискПоПодстроке",
		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ГруппаОтбора, "Наименование", СтрокаПоиска,
		ВидСравненияКомпоновкиДанных.Содержит,,Использование);

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ГруппаОтбора, "Серия", СтрокаПоиска,
		ВидСравненияКомпоновкиДанных.Содержит,,Использование);

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ГруппаОтбора, "Номер", СтрокаПоиска,
		ВидСравненияКомпоновкиДанных.Содержит,,Использование);
		
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ГруппаОтбора, "Код", СтрокаПоиска,
		ВидСравненияКомпоновкиДанных.Содержит,,Использование);
		
	// Удалим элемент из истории поиска если он там был
	НомерНайденногоЭлементаСписка = ИсторияПоиска.НайтиПоЗначению(СтрокаПоиска);
	Пока НомерНайденногоЭлементаСписка <> Неопределено Цикл
		ИсторияПоиска.Удалить(НомерНайденногоЭлементаСписка);
		НомерНайденногоЭлементаСписка = ИсторияПоиска.НайтиПоЗначению(СтрокаПоиска);
	КонецЦикла;	
	
	// И поставим его на первое место
	ИсторияПоиска.Вставить(0, СтрокаПоиска);
	Пока ИсторияПоиска.Количество() > 1000 Цикл
		ИсторияПоиска.Удалить(ИсторияПоиска.Количество() - 1);
	КонецЦикла;


КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПоиск()

	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(ДенежныеДокументы.Отбор,, "ПоискПоПодстроке");

КонецПроцедуры // ОчиститьПоиск()

//&НаКлиенте
//Процедура УстановитьОтборПоВидуДД()
//	
//	ОтборПоВидуДД = Элементы.ВидыДенежныхДокументов.ТекущаяСтрока;
//	
//	Если ЗначениеЗаполнено(ОтборПоВидуДД) Тогда
//		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
//			ДенежныеДокументы.Отбор, "Владелец", ОтборПоВидуДД,
//			ВидСравненияКомпоновкиДанных.Равно,,Истина);	
//	Иначе
//        ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
//			ДенежныеДокументы.Отбор, "Владелец", Неопределено,
//			ВидСравненияКомпоновкиДанных.НеЗаполнено,,Истина);
//	КонецЕсли;
//КонецПроцедуры
	
&НаСервере
Процедура ОбработатьВыборСправочников(ВидДенежногоДокумента,ДенежныйДокумент, Цена, Количество,Сумма,ТекКоличество)
	
	ИскомыеСтроки = ПодобранныеДанные.НайтиСтроки(Новый Структура("ВидДенежногоДокумента,ДенежныйДокумент",ВидДенежногоДокумента,ДенежныйДокумент));
	Если ИскомыеСтроки.Количество() = 0 Тогда
		НовСтр = ПодобранныеДанные.Добавить();
		НовСтр.ВидДенежногоДокумента = ВидДенежногоДокумента;
		НовСтр.ДенежныйДокумент = ДенежныйДокумент;
		НовСтр.Количество = ТекКоличество;
		НовСтр.Сумма = Цена*ТекКоличество;
		СформироватьИнформационнуюНадпись(ЭтаФорма);
	Иначе
		ТекСтр = ИскомыеСтроки[0];
		ТекСтр.Количество = ТекСтр.Количество+ТекКоличество;
		Если Количество>0 Тогда
			ТекСтр.Количество = Мин(ТекСтр.Количество,Количество);
		КонецЕсли;
		ТекСтр.Сумма = ТекСтр.Количество*Цена;		 
	КонецЕсли;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьИнформационнуюНадпись(Форма)
											
	Форма.ИнформационнаяНадпись = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
		НСтр("ru=';Всего подобрана %1 позиция;;Всего подобрано %1 позиции;Всего подобрано %1 позиций;'"), 
		Форма.ПодобранныеДанные.Количество());												

КонецПроцедуры

&НаСервере
Процедура УправлениеСписком()
	
	Если Не Параметры.ПоказыватьОстатки Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.ОстаткиПоРегиструНакопления Тогда
		
		УчетПоПодразделениям = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям");
		
		ДенежныеДокументы.ТекстЗапроса =
		"ВЫБРАТЬ
		|	ДенежныеДокументыПереопределяемый.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ДенежныеДокументыПереопределяемый.НомСтоимость КАК НомСтоимость,
		|	ДенежныеДокументыПереопределяемый.Серия КАК Серия,
		|	ДенежныеДокументыПереопределяемый.Номер КАК Номер,
		|	ДенежныеДокументыПереопределяемый.Ссылка КАК Ссылка,
		|	ДенежныеДокументыПереопределяемый.Владелец КАК Владелец,
		|	ДенежныеДокументыПереопределяемый.Наименование КАК Наименование,
		|	ДенежныеДокументыПереопределяемый.Код КАК Код,
		|	ЕСТЬNULL(ДенежныеДокументыОстатки.КоличествоОстаток, 0) КАК Количество,
		|	ЕСТЬNULL(ДенежныеДокументыОстатки.СуммаОстаток, 0) КАК Сумма
		|ИЗ
		|	Справочник.ДенежныеДокументы КАК ДенежныеДокументыПереопределяемый
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДенежныеДокументы.Остатки({(&ДатаОстатки)}, {(Организация), (Подразделение), (КФО)}) КАК ДенежныеДокументыОстатки
		|		ПО ДенежныеДокументыПереопределяемый.Ссылка = ДенежныеДокументыОстатки.ДенежныйДокумент
		|			И ДенежныеДокументыПереопределяемый.Владелец = ДенежныеДокументыОстатки.ВидДенежногоДокумента";
		
		ДенежныеДокументы.ОсновнаяТаблица = "Справочник.ДенежныеДокументы";
		
		ДатаОстатки = ?(НЕ ЗначениеЗаполнено(Параметры.Дата), Неопределено, Параметры.Дата);
		ДенежныеДокументы.Параметры.УстановитьЗначениеПараметра("ДатаОстатки", ДатаОстатки);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ДенежныеДокументы.Отбор,
			"КФО",Параметры.КФО,,,ЗначениеЗаполнено(Параметры.КФО),
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ДенежныеДокументы.Отбор,
			"Подразделение",Параметры.Подразделение,,,ЗначениеЗаполнено(Параметры.Подразделение) И УчетПоПодразделениям,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ДенежныеДокументы.Отбор,
			"Организация",Параметры.Организация,,,ЗначениеЗаполнено(Параметры.Организация),
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ДенежныеДокументы.Отбор,
			"Количество",0,ВидСравненияКомпоновкиДанных.Больше,,Истина,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
		
	Иначе
		
		ВидыСубконто = Новый Массив;
		ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ВидыДенежныхДокументов);
		ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ДенежныеДокументы);
		Если Параметры.СчетУчета <> БухгалтерскийУчет.СчетПоКоду("201.35") Тогда
			ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ЦМО);
		КонецЕсли;
		
		УчетПоИФО = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО");
		
		УчетПоПодразделениям = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям");
		
		УчетПоПодразделениямСчетаУчета = БухгалтерскиеОперации.ПолучитьСвойствоСчета(Параметры.СчетУчета,"УчетПоПодразделениям");
		
		УчетПоПодразделениям = УчетПоПодразделениям И УчетПоПодразделениямСчетаУчета;
		
		ДенежныеДокументы.ТекстЗапроса =
		"ВЫБРАТЬ
		|	ДенежныеДокументыПереопределяемый.ЕдиницаИзмерения,
		|	ДенежныеДокументыПереопределяемый.НомСтоимость,
		|	ДенежныеДокументыПереопределяемый.Серия,
		|	ДенежныеДокументыПереопределяемый.Номер,
		|	ДенежныеДокументыПереопределяемый.Ссылка,
		|	ДенежныеДокументыПереопределяемый.Владелец,
		|	ДенежныеДокументыПереопределяемый.Наименование,
		|	ДенежныеДокументыПереопределяемый.Код,
		|	ЕСТЬNULL(ЖурналПроводокЕПСБУОстатки.КоличествоОстаток, 0) КАК Количество,
		|	ЕСТЬNULL(ЖурналПроводокЕПСБУОстатки.СуммаОстаток, 0) КАК Сумма
		|ИЗ
		|	Справочник.ДенежныеДокументы КАК ДенежныеДокументыПереопределяемый
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки({(&ДатаОстатки)}, {(Счет).* КАК Счет}, {(&ВидыСубконто)}, {(Организация), (ИФО), (Подразделение), (КПС), (КФО), (Субконто1) КАК ВидДенежногоДокумента, (Субконто2) КАК ДенежныйДокумент, (Субконто3) КАК ЦМО}) КАК ЖурналПроводокЕПСБУОстатки
		|		ПО (ЖурналПроводокЕПСБУОстатки.Субконто2 = ДенежныеДокументыПереопределяемый.Ссылка)
		|			И (ЖурналПроводокЕПСБУОстатки.Субконто1 = ДенежныеДокументыПереопределяемый.Владелец)";
		
		ДенежныеДокументы.ОсновнаяТаблица = "Справочник.ДенежныеДокументы";
		
		ДатаОстатки = ?(НЕ ЗначениеЗаполнено(Параметры.Дата), Неопределено, Параметры.Дата);
		ДенежныеДокументы.Параметры.УстановитьЗначениеПараметра("ДатаОстатки", ДатаОстатки);
		ДенежныеДокументы.Параметры.УстановитьЗначениеПараметра("ВидыСубконто", ВидыСубконто);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ДенежныеДокументы.Отбор,
			"КФО",Параметры.КФО,,,ЗначениеЗаполнено(Параметры.КФО),
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ДенежныеДокументы.Отбор,
			"Подразделение",Параметры.Подразделение,,,ЗначениеЗаполнено(Параметры.Подразделение) И УчетПоПодразделениям,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ДенежныеДокументы.Отбор,
			"ИФО",Параметры.ИФО,,,ЗначениеЗаполнено(Параметры.ИФО)И УчетПоИФО,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ДенежныеДокументы.Отбор,
			"Организация",Параметры.Организация,,,ЗначениеЗаполнено(Параметры.Организация),
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ДенежныеДокументы.Отбор,
			"Счет",Параметры.СчетУчета,,,Истина,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ДенежныеДокументы.Отбор,
			"ЦМО",Параметры.ЦМО,,,ЗначениеЗаполнено(Параметры.ЦМО),
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ДенежныеДокументы.Отбор,
			"Количество",0,ВидСравненияКомпоновкиДанных.Больше,,Истина,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьСуммуСтроки(ИднСтроки)
	ТекСтр = ПодобранныеДанные.НайтиПоИдентификатору(ИднСтроки);
	Если НЕ ЗначениеЗаполнено(ТекСтр.ДенежныйДокумент) Тогда
		Возврат;
	КонецЕсли;
	Цена = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекСтр.ДенежныйДокумент,"НомСтоимость");
	ТекСтр.Сумма = ТекСтр.Количество * Цена;
КонецПроцедуры

#КонецОбласти
